Revit 2026 API

# ControlledApplicationCurrentUserAddinsLocation Property

---

Add-ins location for current user.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CurrentUserAddinsLocation { get; }
```
```vb
Public ReadOnly Property CurrentUserAddinsLocation As String
	Get
```
```cpp
public:
property String^ CurrentUserAddinsLocation {
	String^ get ();
}
```
```fsharp
member CurrentUserAddinsLocation : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace